src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.НеоплаченныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Заказ/Forms/ФормаЗаказа/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовар

&НаКлиенте
Процедура ТоварТоварПриИзменении(Элемент)
	
	Перем КоличествоПоУмолчанию;

	ДатаВремяЗаказа = Объект.Дата;
	ДатаЗаказа = НачалоДня(ДатаВремяЗаказа);
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	ВыбраннаяНоменклатура = ТекущаяСтрока.Товар;
	
	Цена = ЗапросыСКлиентаВызовСервера.ПолучитьЦену(ДатаЗаказа, ВыбраннаяНоменклатура);

	Если ЗначениеЗаполнено(Цена) Тогда
		
		КоличествоПоУмолчанию = 1;
		
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чекни цену, братиш! Чё-то с ней не так: " + Цена;
		Сообщение.Сообщить();
		
		КоличествоПоУмолчанию = 0;
		Цена = 0;
		
	КонецЕсли;
	
	ТекущаяСтрока.ЦенаЗаЕдиницу = Цена;
	ТекущаяСтрока.Количество = КоличествоПоУмолчанию;
	
	ПосчитатьСуммуПозиции(ТекущаяСтрока);
	СуммаЗаказа = ПосчитатьСуммуЗаказа();
	Объект.СуммаЗаказа = СуммаЗаказа;

КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	
	ПосчитатьСуммуПозиции(ТекущаяСтрока);
	СуммаЗаказа = ПосчитатьСуммуЗаказа();
	Объект.СуммаЗаказа = СуммаЗаказа;

КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПосчитатьСуммуПозиции(Строка)
	
	Строка.СуммаПозиции = Строка.ЦенаЗаЕдиницу * Строка.Количество;
	
КонецПроцедуры

&НаКлиенте
Функция ПосчитатьСуммуЗаказа()
	
	СуммаЗаказа = 0;
	
	Для Каждого СтрокаТовар из Объект.Товар Цикл

		СуммаЗаказа = СуммаЗаказа + СтрокаТовар.СуммаПозиции;
		
	КонецЦикла;
	
	Возврат СуммаЗаказа;
	
КонецФункции

#КонецОбласти



//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти
